<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN">
<HTML>
<HEAD>
<meta name="generator" content="HTML Tidy, see www.w3.org"> <TITLE>Bienvenido a JBuilder: Creaci&oacute;n de proyectos</TITLE>
<link type="text/css" href="welcome.css" rel="stylesheet"> </HEAD>
<BODY>
<a href="Welcome.html"><img src="images/home.gif" alt="Home" border="0"></a><a href="welcome_UI.html"><img src="images/back.gif" alt="Go back" border="0"></a><a href="welcome_editing.html"><img src="images/forward.gif" alt="Go forward" border="0"></a>  

<H2>Creaci&oacute;n de proyectos</H2>

<P>Todo el trabajo que se realiza en JBuilder debe hacerse dentro del contexto de un proyecto. Un <em>proyecto</em> de JBuilder es una herramienta de organizaci&oacute;n que incluye todos los archivos de la aplicaci&oacute;n y su estructura de directorios, as&iacute; como las v&iacute;as de acceso, las opciones de configuraci&oacute;n y los recursos necesarios. Cada proyecto se administra mediante un archivo de proyecto, que es un archivo descriptivo con la extensi&oacute;n <code>.jpx</code>.</P>

<P>Para crear un proyecto en JBuilder y a&ntilde;adirle un archivo de c&oacute;digo fuente, siga estos pasos:</P>

<OL>
<LI>Elija Archivo|Nuevo. En el Asistente para proyectos, especifique el nombre del proyecto y el directorio de archivos fuente. Pulse el bot&oacute;n Finalizar.</LI>
<LI>Elija Archivo|Nuevo. En el Asistente para clases, escriba el nombre de la clase y pulse Aceptar.</LI>
<LI>Elija Archivo|Guardar todo.</LI>
</OL>

<P>En el panel del proyecto aparece el archivo de proyecto junto con el archivo fuente, que ahora se encuentra integrado en &eacute;l. </P>

<P><img src="images/welcome_newproject.gif" alt="Project pane"></P>

<P>Si desea a&ntilde;adir un archivo vac&iacute;o al proyecto, elija Archivo|Archivo nuevo, indique el nombre y el tipo del archivo y pulse Aceptar. </P>

<H3>Utilizaci&oacute;n de diferentes versiones del JDK</H3>

<P>JBuilder admite los cambios de JDK. Pulse el archivo del proyecto con el bot&oacute;n derecho del rat&oacute;n en el panel del proyecto, y seleccione Propiedades. Pulse el bot&oacute;n de puntos suspensivos del JDK en la ficha V&iacute;as de acceso, busque la versi&oacute;n del JDK deseada y pulse Aceptar. </P>

<H3>Uso de bibliotecas en JBuilder</H3>
<P>JBuilder utiliza las bibliotecas con el fin de buscar los elementos que necesita para ejecutar un proyecto, as&iacute; como examinar el c&oacute;digo fuente, ver los comentarios Javadoc, utilizar el dise&ntilde;ador visual, aplicar CodeInsight y compilar el c&oacute;digo. Las bibliotecas son recopilaciones de v&iacute;as de acceso que incluyen archivos de clase, c&oacute;digo fuente y documentaci&oacute;n. Las bibliotecas son est&aacute;ticas, no din&aacute;micas. Las v&iacute;as de acceso de las bibliotecas se suelen incluir en archivos JAR o ZIP, pero tambi&eacute;n pueden residir en directorios. La configuraci&oacute;n de las bibliotecas se guarda en archivos <code>.library</code>. </P>
<P>El cuadro de di&aacute;logo Configurar bibliotecas (Herramientas|Configurar bibliotecas) permite reorganizar las bibliotecas y a&ntilde;adir otras. Adem&aacute;s, la ficha V&iacute;as de acceso del cuadro de di&aacute;logo Propiedades de proyecto (Proyecto|Propiedades de proyecto) permite a&ntilde;adir bibliotecas necesarias al proyecto. </P>



<P>Si desea m&aacute;s informaci&oacute;n, consulte:
<BR>
<span class="normal"><cite>Generaci&oacute;n de aplicaciones con JBuilder</cite> &#160;<a href="../../doc/bajb/project.html">Creaci&oacute;n y gesti&oacute;n de proyectos</a></span> <BR>
<span class="normal"><cite>Generaci&oacute;n de aplicaciones con JBuilder</cite> &#160;<a href="../../doc/bajb/project.html#setjdk">Configuraci&oacute;n del JDK</a></span> <BR>
Generaci&oacute;n de aplicaciones con JBuilder &nbsp;<a href="../../doc/bajb/pathmgmt.html#libraries">Las bibliotecas</a></span> </P>


<P><a href="welcome_UI.html"><img src="images/leftarrow.gif" alt="Go back" border="0"></a>&#160;<a href="welcome_editing.html"><img src="images/rightarrow.gif" alt="Go forward" border="0"></a></P>

</BODY>
</HTML>



