<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN">
<HTML>
<HEAD>
<meta name="generator" content="HTML Tidy, see www.w3.org"> <TITLE>Bienvenido a JBuilder: El visualizador de la ayuda</TITLE>
<link type="text/css" href="welcome.css" rel="stylesheet"> </HEAD>
<BODY>
<a href="Welcome.html"><img src="images/home.gif" alt="Home" border="0"></a><a href="welcome_uml.html"><img src="images/back.gif" alt="Go back" border="0"></a><a href="welcome_debugging.html"><img src="images/forward.gif" alt="Go forward" border="0"></a>  

<H2>Perfeccionamiento (refactoring) de s&iacute;mbolos de c&oacute;digo</H2>

<blockquote class="bsku">Es una funci&oacute;n de JBuilder Developer y Enterprise.</blockquote> 
<P>JBuilder proporciona muchos tipos de perfeccionamientos (refactoring):</P>

<UL>
<LI>Optimizar importaciones</LI>
<LI>Perfeccionamiento por cambio de nombre</LI>
<LI>Perfeccionamiento por movimiento</LI>
<LI>Cambiar par&aacute;metros</LI>
<LI>Extraer m&eacute;todo</LI>
<LI>Introducir variable</LI>
<LI>Insertar en bloque try/catch</LI>
</UL>

<P>Se accede a las opciones de perfeccionamiento desde el men&uacute; contextual del editor, desde el men&uacute; Edici&oacute;n, desde el panel de estructura y desde un men&uacute; contextual de los diagramas UML. Para realizar el perfeccionamiento desde el editor, seleccione un s&iacute;mbolo o expresi&oacute;n, haga clic con el bot&oacute;n derecho del rat&oacute;n y escoja un comando de perfeccionamiento. Algunos perfeccionamientos abren un cuadro de di&aacute;logo y una pesta&ntilde;a Perfeccionamiento en el panel de mensajes; otros, por el contrario, se realizan autom&aacute;ticamente. La pesta&ntilde;a Perfeccionamiento muestra una vista previa del perfeccionamiento.</P>

<P><img src="images/welcome_refactoring.gif" border="0" alt="Refactoring tab"></P>

<P>Antes de realizar el perfeccionamiento, JBuilder proporciona diferentes mecanismos para obtener informaci&oacute;n sobre un s&iacute;mbolo. Puede encontrar su definici&oacute;n mediante el comando Buscar definici&oacute;n, situado en el men&uacute; contextual del editor. Tambi&eacute;n puede buscar todas las referencias al s&iacute;mbolo mediante el comando Buscar referencias.</P>

<P>Si desea m&aacute;s informaci&oacute;n, consulte:
<BR>
<span class="normal"><cite>Generaci&oacute;n de aplicaciones con JBuilder</cite> &#160;<a href="../../doc/bajb/refactor.html">Perfeccionamiento de s&iacute;mbolos de c&oacute;digo</a></span></P>

<P><a href="welcome_uml.html"><img src="images/leftarrow.gif" alt="Go back" border="0"></a>&#160;<a href="welcome_debugging.html"><img src="images/rightarrow.gif" alt="Go forward" border="0"></a></P>

</BODY>
</HTML>



