<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN">
<HTML>
<HEAD>
<meta name="generator" content="HTML Tidy, see www.w3.org"> <TITLE>Bienvenido a JBuilder: Desarrollo de servicios web</TITLE><link type="text/css" href="welcome.css" rel="stylesheet"> </HEAD>
<BODY>
<a href="Welcome.html"><img src="images/home.gif" alt="Home" border="0"></a><a href="welcome_xml.html"><img src="images/back.gif" alt="Go back" border="0"></a><a href="welcome_mobile.html"><img src="images/forward.gif" alt="Go forward" border="0"></a>  

<H2>Desarrollo de servicios web</H2>

<blockquote class="bsku">&Eacute;sta es una funci&oacute;n de JBuilder Enterprise.</blockquote> <P>Aunque resulta &uacute;til entender la tecnolog&iacute;a subyacente de los servicios web, JBuilder proporciona asistentes y herramientas que permiten su r&aacute;pido desarrollo y consumo. JBuilder utiliza diversos kits de herramientas para servicios web. Cuando se selecciona un kit de herramientas, los asistentes de JBuilder lo utilizan para habilitar proyectos de servicios web, importar servicios y exportar clases Java como servicios web.</P>
<P>Para exportar Enterprise JavaBeans (EJB) como servicios web en JBuilder s&oacute;lo es necesario configurar el proyecto para servicios web. Basta con desarrollar la aplicaci&oacute;n EJB de la forma acostumbrada, configurar el proyecto para servicios web con el  Asistente para configuraci&oacute;n de servicios web y ejecutar el proyecto con la configuraci&oacute;n de ejecuci&oacute;n del servidor de servicios web creada por el asistente. Por defecto, JBuilder expone autom&aacute;ticamente todos los beans sesi&oacute;n sin estado con m&eacute;todos empresariales en la interfaz remota. Tambi&eacute;n se puede modificar este comportamiento por defecto y seleccionar &uacute;nicamente los m&oacute;dulos, beans y m&eacute;todos del Enterprise JavaBean que se deseen exponer como servicios web.</P>

<P>Entre las funciones de servicios web de JBuilder que var&iacute;an seg&uacute;n el kit de herramientas utilizado se incluyen:</P>

<UL>
<LI> Configuraci&oacute;n del proyecto para los servicios web.</LI>
	<LI>Creaci&oacute;n de un documento WSDL que describe el servicio web desarrollado. </LI>
	<LI>Creaci&oacute;n de stubs clientes que llaman a un servicio web.</LI>
	<LI>Importaci&oacute;n de un EAR o un WSDL en el que se describe un servicio web y creaci&oacute;n de clases que llaman al servicio.</LI>
	<LI>Creaci&oacute;n de c&oacute;digo de servidor que aloja localmente el servicio.</LI>
	<LI>Creaci&oacute;n de servicios web as&iacute;ncronos con el kit de herramientas WebLogic.</LI>
<LI>Exportaci&oacute;n expresa de clases Java como servicios web.</LI>
<LI>Exportaci&oacute;n autom&aacute;tica de los beans sesi&oacute;n sin estado con m&eacute;todos empresariales en la interfaz remota.</LI>
<LI>Seguimiento de los mensajes SOAP entre el cliente y el servicio durante la llamada al servicio.</LI>
<LI>B&uacute;squeda y publicaci&oacute;n de servicios web en un registro UDDI con el Explorador de servicios web. </LI>
</UL>
<P><img src="images/welcome_webserv.gif" border="0"></P>

<P>Si desea m&aacute;s informaci&oacute;n, consulte:
<BR>
<span class="normal"><cite>Gu&iacute;a del desarrollador de servicios web:</cite>&#160;<a href="../../doc/websvcs/websvcs_intro.html">Introducci&oacute;n</a></span> <BR>
<span class="normal">Ejemplos de servicios web:&#160;<code>&lt;jbuilder&gt;/samples/webservices/</code></span> 


</P>


<P><a href="welcome_xml.html"><img src="images/leftarrow.gif" alt="Go back" border="0"></a>&#160;<a href="welcome_mobile.html"><img src="images/rightarrow.gif" alt="Go forward" border="0"></a></P>

</BODY>
</HTML>



