<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN">
<HTML>
<HEAD>
<meta name="generator" content="HTML Tidy, see www.w3.org"> <TITLE>Bienvenido a JBuilder: Dise&ntilde;o de la interfaz de usuario</TITLE>
<link type="text/css" href="welcome.css" rel="stylesheet"> </HEAD>
<BODY>
<a href="Welcome.html"><img src="images/home.gif" alt="Inicio" border="0"></a><a href="welcome_editing.html"><img src="images/back.gif" alt="Atr&aacute;s" border="0"></a><a href="welcome_compiling_running.html"><img src="images/forward.gif" alt="Adelante" border="0"></a>  

<H2>Dise&ntilde;o de la interfaz de usuario</H2>

<P>Para dise&ntilde;ar una ventana, haga doble clic, en el panel del proyecto, en un archivo que admita dise&ntilde;o, como por ejemplo <code>WelcomeFrame.java</code>. A continuaci&oacute;n haga clic en la pesta&ntilde;a Dise&ntilde;o de la parte inferior del Visualizador de aplicaciones. Para a&ntilde;adir un componente a la aplicaci&oacute;n, pulse sobre un componente de la paleta de componentes, su&eacute;ltelo bajo su directorio superior en el &aacute;rbol de componentes o en el lugar en el que desea que aparezca el componente en la superficie de dise&ntilde;o. Asigne valores a las propiedades de componentes y a sucesos modific&aacute;ndolos en el Inspector.</P>

<P><img src="images/welcome_designing.gif" border="0" alt="Dise&ntilde;ador de interfaces de usuario"></P>

<H3>Creaci&oacute;n de men&uacute;s</H3>

<P>Si desea a&ntilde;adir un men&uacute; a la aplicaci&oacute;n, pulse la pesta&ntilde;a Dise&ntilde;o y seleccione un componente JMenuBar&nbsp;<img src="images/welcome_menus_bar.gif" alt="Barra de men&uacute;"> o JPopupMenu&nbsp;<img src="images/welcome_menus_popup.gif" alt="Men&uacute;Emergente"> de la ficha Contenedores Swing de la paleta de componentes.  Coloque el componente en el &aacute;rbol de componentes. A continuaci&oacute;n, en el &aacute;rbol, haga doble clic en el componente men&uacute; para iniciar el dise&ntilde;ador de men&uacute;s, que permite modificar los men&uacute;s y sus opciones.</P>

<P>Si desea m&aacute;s informaci&oacute;n, consulte:
<BR>
<span class="normal"><cite>Dise&ntilde;o de aplicaciones con JBuilder:</cite>&#160;<a href="../../doc/designui/a_basic-components.html#design_requirements">Requisitos para poder dise&ntilde;ar visualmente una clase</a></span> <BR>
<span class="normal"><cite>Dise&ntilde;o de aplicaciones con JBuilder:</cite> &#160;<a href="../../doc/designui/f1_basic-ui.html">Creaci&oacute;n de interfaces de usuario</a></span> <BR>
<span class="normal"><cite>Dise&ntilde;o de aplicaciones con JBuilder:</cite> &#160;<a href="../../doc/designui/g1_basic-menu.html">Dise&ntilde;o de men&uacute;s</a></span></P>


<P><a href="welcome_editing.html"><img src="images/leftarrow.gif" alt="Atr&aacute;s" border="0"></a>&#160;<a href="welcome_compiling_running.html"><img src="images/rightarrow.gif" alt="Adelante" border="0"></a></P>

</BODY>
</HTML>



