 <!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01//EN">
<HTML>
<HEAD>
<meta name="generator" content="HTML Tidy, see www.w3.org"> <TITLE>Bienvenido a JBuilder: Modificaci&oacute;n del c&oacute;digo fuente</TITLE>
<link type="text/css" href="welcome.css" rel="stylesheet"> </HEAD>
<BODY>
<a href="Welcome.html"><img src="images/home.gif" alt="Home" border="0"></a><a href="welcome_newproject.html"><img src="images/back.gif" alt="Go back" border="0"></a><a href="welcome_designing.html"><img src="images/forward.gif" alt="Go forward" border="0"></a>  

<H2>Modificaci&oacute;n del c&oacute;digo fuente</H2>

<P>El editor ofrece una amplia gama de funciones de productividad, como la correspondencia de llaves de apertura y cierre, el resaltado de sintaxis, los atajos de teclado, la personalizaci&oacute;n de la configuraci&oacute;n de teclado del editor, los atajos de codificaci&oacute;n (CodeInsight, ErrorInsight, Sync Edit, JavadocInsight), las plantillas de c&oacute;digo personalizables, la b&uacute;squeda y la impresi&oacute;n, as&iacute; como un editor completamente personalizable. </P>

<P>Si desea modificar el c&oacute;digo fuente, pulse dos veces en un archivo del panel del proyecto para abrirlo en el editor. En la parte superior del panel de contenido aparece una pesta&ntilde;a correspondiente al archivo abierto. Esto facilita el desplazamiento entre los archivos abiertos de un proyecto.</P>

<P><img src="images/welcome_edit.gif" border="0" alt="Editor"></P>

<P>El cuadro de di&aacute;logo Opciones del editor (Herramientas|Opciones del editor) permite personalizar el entorno de edici&oacute;n. Es posible controlar las siguientes opciones del editor: </P>

<UL>
<LI>Configuraci&oacute;n de teclado del editor</LI>
<LI>N&uacute;mero de copias de seguridad que desea conservar</LI>
<LI>Opciones de sangrado y tabulaci&oacute;n</LI>
<LI>Opciones de numeraci&oacute;n de l&iacute;neas y teclas inteligentes</LI>
<LI>Opciones de guardado y b&uacute;squeda</LI>
<LI>Opciones de resaltado de llaves correspondientes y presentaci&oacute;n de errores</LI>
<LI>M&aacute;rgenes</LI>
<LI>Fuentes</LI>
<LI>Configuraci&oacute;n de colores del editor para Java, HTML/XML/JSP y otros elementos</LI>
<LI>Presentaci&oacute;n y ventanas emergentes de CodeInsight (MemberInsight, ParameterInsight, JavadocInsight)</LI>
<LI>Plantillas de c&oacute;digo para Java y HTML, y plantillas comunes</LI>
<LI>Presentaci&oacute;n de la estructura de Java</LI>
</UL>


<P>Si desea m&aacute;s informaci&oacute;n, consulte:
<BR>
<span class="normal"><cite>Introducci&oacute;n a JBuilder:</cite> <a href="../../doc/introjb/enveditor.html">El editor</a></span> <BR>
<span class="normal"><cite>Introducci&oacute;n a JBuilder:</cite> &#160;<a href="../../doc/introjb/enveditorops.html">Personalizaci&oacute;n del editor</a></span></P>

<P><a href="welcome_newproject.html"><img src="images/leftarrow.gif" alt="Go back" border="0"></a>&#160;<a href="welcome_designing.html"><img src="images/rightarrow.gif" alt="Go forward" border="0"></a></P>

</BODY>
</HTML>



