<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN">
<HTML>
<HEAD>
<meta name="generator" content="HTML Tidy, see www.w3.org"> <TITLE>Bienvenido a JBuilder: Desarrollo de aplicaciones web</TITLE>
<link type="text/css" href="welcome.css" rel="stylesheet"> </HEAD>
<BODY>
<a href="Welcome.html"><img src="images/home.gif" alt="Home" border="0"></a><a href="welcome_database.html"><img src="images/back.gif" alt="Go back" border="0"></a><a href="welcome_ejb.html"><img src="images/forward.gif" alt="Go forward" border="0"></a>  


<H2>Desarrollo de aplicaciones web</H2>

<blockquote class="bsku">El desarrollo web es una funci&oacute;n de JBuilder Developer y Enterprise. El desarrollo de applets es una funci&oacute;n de todas las ediciones de JBuilder.</blockquote> 
<P>JBuilder proporciona numerosas herramientas que facilitan el desarrollo de aplicaciones web:</P>

<UL>
<LI>Los asistentes facilitan la creaci&oacute;n de aplicaciones web, applets, servlets, p&aacute;ginas JavaServer (JSP), aplicaciones web habilitadas para Struts y archivos JNLP, adem&aacute;s de p&aacute;ginas de inicio para aplicaciones Java Web Start.</LI>
<LI>El marco y la aceptaci&oacute;n de bibliotecas de etiquetas JSP permiten a&ntilde;adir f&aacute;cilmente a la WebApp o la JSP la compatibilidad con diversos marcos y bibliotecas de etiquetas.</LI>
<LI>JBuilder incluye conocidos marcos y bibliotecas de etiquetas, como Struts, JSTL (biblioteca de etiquetas est&aacute;ndar para p&aacute;ginas JSP) e InternetBeans Express.</LI>
<LI>La generaci&oacute;n autom&aacute;tica de archivos WAR facilita la creaci&oacute;n de recopilatorios para las aplicaciones web.</LI>
<LI>El Creador de recopilatorios ayuda a crear archivos JAR para applets, applets Java Web Start u aplicaciones Java Web Start.</LI>
<LI>El Editor DD de WebApp proporciona una interfaz gr&aacute;fica en la que se puede modificar el archivo descriptor de distribuci&oacute;n web.xml.</LI>
<LI>El Editor de configuraci&oacute;n de Struts proporciona una interfaz gr&aacute;fica en la que se puede modificar el archivo descriptor de distribuci&oacute;n struts-config.xml.</LI>
</UL>

<p class="bfig">Asistente para aplicaciones web</P>
<P><img src="images/welcome_webapp.gif" border="0" alt="Web Application wizard"></P>

<P>Si desea m&aacute;s informaci&oacute;n, consulte:
<BR>
<span class="normal"><cite>Gu&iacute;a del desarrollador de aplicaciones web</cite> &#160;<a href="../../doc/webapps/webapps_intro.html">Introducci&oacute;n</a> <BR>
<cite>Gu&iacute;a del desarrollador de aplicaciones web</cite> &#160;<a href="../../doc/webapps/webapps_develop.html">Introducci&oacute;n general al proceso de desarrollo de aplicaciones web</a> </span> <BR>
<span class="normal"><cite>Referencia de la biblioteca de componentes DataExpress:</cite> &#160;<a href="../../doc/apiref/com/borland/internetbeans/package-summary.html">Package com.borland.internetbeans</a></span> 

</P>

<P><a href="welcome_database.html"><img src="images/leftarrow.gif" alt="Go back" border="0"></a>&#160;<a href="welcome_ejb.html"><img src="images/rightarrow.gif" alt="Go forward" border="0"></a></P>

</BODY>
</HTML>



